<template>
  <ui-spoiler class="spoiler">
    <template #header="{ toggle, state }">
      <div class="flex items-center gap-1 text-sm pl-1.5">
        <ui-icon name="ExclamationMark" active></ui-icon>
        <button type="button" @click="toggle">
          Внимание, при нажатии раскрывается информация про страны
          <ui-icon name="ArrowTick" :class="['tick', 'ml-1', { 'tick--active': state }]"></ui-icon>
        </button>
      </div>
    </template>

    <p class="text-xs mb-2.5 mt-2.5">Зачисление до 6 минут</p>
    <p class="text-xs mb-0.5">Эта платежная система не принимает платежи из стран:</p>
    <p class="text-xs">
      Армения, Австрия, Азербайджан, Бельгия, Болгария, Кипр, Чешская Республика, Дания, Эстония,
      Финляндия, Франция, Грузия, Германия, Греция, Венгрия, Исландия, Ирландия, Испания, Италия,
      Кыргызстан, Латвия, Литва, Люксембург, Мальта, Румыния, Сербия и Черногория, Словакия,
      Словения, Швеция, Швейцария, Таджикистан, Турция, Туркменистан, Соединенное Королевство,
      Узбекистан, Австралия, Норвегия, Израиль, Португалия, Нидерланды, Саудовская Аравия,
      Объединенные Арабские Эмираты, Сингапур, Новая Зеландия, Хорватия, Польша, Бруней-Даруссалам,
      Перу, Южная Корея, Катар, Египет.
    </p>
  </ui-spoiler>
</template>

<script setup lang="ts"></script>

<style lang="scss" scoped></style>
